app/controllers/clients_controller.rb

  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save
---
INSERT INTO "clients" ("name", "contact_name", "phone_number", "email", "NIT", "invoice_contact", "invoice_email", "province", "canton", "district", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @client.update(client_params)
---
UPDATE "clients" SET "phone_number" = ?, "invoice_contact" = ?, "updated_at" = ? WHERE "clients"."id" = ?  [["phone_number", "22-88-25-78"], ["invoice_contact", "Consulta con Vanesa Asistente"], ["updated_at", "2018-08-09 17:50:29.081941"], ["id", 31]]